logs/fio-diskrnd/bridge-operator/000/log009.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=randwrite --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;95133;371;88177;0;0;0.000000;0.000000;92;68288;2674.821729;5534.269651;1.000000%=95;5.000000%=95;10.000000%=96;20.000000%=97;30.000000%=98;40.000000%=102;50.000000%=115;60.000000%=156;70.000000%=177;80.000000%=7569;90.000000%=10682;95.000000%=13565;99.000000%=24772;99.500000%=26083;99.900000%=40108;99.950000%=42205;99.990000%=44302;0%=0;0%=0;0%=0;95;68291;2678.552756;5534.051953;6656;1315328;100.000000%;95254.772727;129085.607569;0.123616%;5.090954%;7392;5;159;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;36.11%;42.19%;0.03%;0.00%;0.00%;0.67%;0.12%;9.16%;9.99%;1.72%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;107;19190;0;0;6069;296216;302285;91.58%;slaves;119;28444;0;86;6967;312827;321302;98.74%;sda;119;28444;0;86;6967;312827;321302;98.74%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=13055: Wed Nov 22 17:07:52 2023
  write: IOPS=371, BW=92.9MiB/s (97.4MB/s)(8192MiB/88177msec); 0 zone resets
    clat (usec): min=92, max=68288, avg=2674.82, stdev=5534.27
     lat (usec): min=95, max=68291, avg=2678.55, stdev=5534.05
    clat percentiles (usec):
     |  1.00th=[   96],  5.00th=[   96], 10.00th=[   97], 20.00th=[   98],
     | 30.00th=[   99], 40.00th=[  103], 50.00th=[  116], 60.00th=[  157],
     | 70.00th=[  178], 80.00th=[ 7570], 90.00th=[10683], 95.00th=[13566],
     | 99.00th=[24773], 99.50th=[26084], 99.90th=[40109], 99.95th=[42206],
     | 99.99th=[44303]
   bw (  KiB/s): min= 6656, max=1315328, per=100.00%, avg=95254.77, stdev=129085.61, samples=176
   iops        : min=   26, max= 5138, avg=372.09, stdev=504.24, samples=176
  lat (usec)   : 100=36.11%, 250=42.19%, 500=0.03%
  lat (msec)   : 2=0.67%, 4=0.12%, 10=9.16%, 20=9.99%, 50=1.72%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.12%, sys=5.09%, ctx=7392, majf=5, minf=159
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=92.9MiB/s (97.4MB/s), 92.9MiB/s-92.9MiB/s (97.4MB/s-97.4MB/s), io=8192MiB (8590MB), run=88177-88177msec

Disk stats (read/write):
    dm-0: ios=107/19190, merge=0/0, ticks=6069/296216, in_queue=302285, util=91.58%, aggrios=119/28444, aggrmerge=0/86, aggrticks=6967/312827, aggrin_queue=321302, aggrutil=98.74%
  sda: ios=119/28444, merge=0/86, ticks=6967/312827, in_queue=321302, util=98.74%
+ fio --rw=randread --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=randread, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;226217;883;37082;0;0;0.000000;0.000000;550;126221;1127.735820;3348.189921;1.000000%=765;5.000000%=790;10.000000%=798;20.000000%=815;30.000000%=839;40.000000%=847;50.000000%=856;60.000000%=864;70.000000%=880;80.000000%=921;90.000000%=970;95.000000%=1449;99.000000%=3784;99.500000%=4358;99.900000%=70778;99.950000%=74973;99.990000%=85458;0%=0;0%=0;0%=0;550;126222;1128.052997;3348.189905;3584;302592;99.989522%;226193.297297;113863.534252;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.458456%;11.472183%;32781;0;287;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.44%;91.32%;3.86%;3.83%;0.23%;0.02%;0.13%;0.16%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;32572;2447;0;0;33919;21511;55430;97.17%;slaves;32788;4357;1;10;34307;20398;54706;98.03%;sda;32788;4357;1;10;34307;20398;54706;98.03%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=13154: Wed Nov 22 17:08:30 2023
  read: IOPS=883, BW=221MiB/s (232MB/s)(8192MiB/37082msec)
    clat (usec): min=550, max=126221, avg=1127.74, stdev=3348.19
     lat (usec): min=550, max=126222, avg=1128.05, stdev=3348.19
    clat percentiles (usec):
     |  1.00th=[  766],  5.00th=[  791], 10.00th=[  799], 20.00th=[  816],
     | 30.00th=[  840], 40.00th=[  848], 50.00th=[  857], 60.00th=[  865],
     | 70.00th=[  881], 80.00th=[  922], 90.00th=[  971], 95.00th=[ 1450],
     | 99.00th=[ 3785], 99.50th=[ 4359], 99.90th=[70779], 99.95th=[74974],
     | 99.99th=[85459]
   bw (  KiB/s): min= 3584, max=302592, per=99.99%, avg=226193.30, stdev=113863.53, samples=74
   iops        : min=   14, max= 1182, avg=883.57, stdev=444.78, samples=74
  lat (usec)   : 750=0.44%, 1000=91.32%
  lat (msec)   : 2=3.86%, 4=3.83%, 10=0.23%, 20=0.02%, 50=0.13%
  lat (msec)   : 100=0.16%, 250=0.01%
  cpu          : usr=0.46%, sys=11.47%, ctx=32781, majf=0, minf=287
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=221MiB/s (232MB/s), 221MiB/s-221MiB/s (232MB/s-232MB/s), io=8192MiB (8590MB), run=37082-37082msec

Disk stats (read/write):
    dm-0: ios=32572/2447, merge=0/0, ticks=33919/21511, in_queue=55430, util=97.17%, aggrios=32788/4357, aggrmerge=1/10, aggrticks=34307/20398, aggrin_queue=54706, aggrutil=98.03%
  sda: ios=32788/4357, merge=1/10, ticks=34307/20398, in_queue=54706, util=98.03%